Task 1.1 Write a function in python that identify which columns have date in them

Task 1.2 Using these date columns make new columns which are difference between these columns taking 2 at a time. (difference of days between dates). For instance - Data set contains 4 date columns which are start date, end date, DOB and Date of promotion. Then you will form 6 new columns containing difference of these date by taking 2 date at a time. One of the new column would be DOB - end date. But the data can contain any number of date columns (dataset has n number of date columns)

In [66]:
import numpy as np
import pandas as pd

from datetime import date

end_date = pd.DataFrame({'End date':
['01-01-2017',
'04-12-2008',
'23-06-1988',
'25-08-1999',
'20-02-1993',
]})

start_date = pd.DataFrame({' Start date':
['05-01-2014',
'04-10-2006',
'23-04-1985',
'25-07-1997',
'20-02-1990',
]})

datab = pd.DataFrame({'Date of birth':
['14-05-1992',
'20-08-1994',
'25-02-1996',
'27-02-1997',
'2-02-1990',
]})

Prom_date = pd.DataFrame({'Promotion date':
['26-08-2017',
'18-05-2019',
'10-04-2018',
'9-03-2020',
'11-06-2020',
]})

In [80]:
finaldata = pd.concat([start_date,end_date,datab, Prom_date], axis =1)
finaldata

   Start date    End date Date of birth Promotion date
0  05-01-2014  01-01-2017    14-05-1992     26-08-2017
1  04-10-2006  04-12-2008    20-08-1994     18-05-2019
2  23-04-1985  23-06-1988    25-02-1996     10-04-2018
3  25-07-1997  25-08-1999    27-02-1997      9-03-2020
4  20-02-1990  20-02-1993     2-02-1990     11-06-2020

In [71]:
finaldata

   Start date    End date Date of birth Promotion date
0  05-01-2014  01-01-2017    14-05-1992     26-08-2017
1  04-10-2006  04-12-2008    20-08-1994     18-05-2019
2  23-04-1985  23-06-1988    25-02-1996     10-04-2018
3  25-07-1997  25-08-1999    27-02-1997      9-03-2020
4  20-02-1990  20-02-1993     2-02-1990     11-06-2020

In [37]:
start_date['date'] = pd.to_datetime(start_date.date, format="%d-%m-%Y")
end_date['date'] = pd.to_datetime(end_date.date, format="%d-%m-%Y")
#datab['date'] = pd.to_datetime(datab.date, format = "%d-%m-%y")
#Prom_date['date'] = pd.to_datetime(Prom_date.date, format = "%d-%m-%y")

In [94]:
##TASK1:

In [16]:
# import datetime class from datetime module
from datetime import datetime

# get current date
datetime_object = datetime.now()

In [17]:
print(datetime_object)

2020-06-23 16:32:23.665421

Task 2.1 Write a function in python that drop columns having Pearson correlation more than 0.85

Thing to consider

· Code should drop least amount of variable as possible

· Code should be efficient and fast

· Make a dummy correlation matrix by yourself to test out your logic

· Code should be well commented and easy to interpret

· Use google Colab

· Code should be robust enough to run on any dataset

· To test out the logic we will pass a random dataframe into your function

In [95]:
startupData = pd.read_csv('50_Startups.csv')

In [98]:
startupData.head()

   R&D Spend  Administration  Marketing Spend       State     Profit
0  165349.20       136897.80        471784.10    New York  192261.83
1  162597.70       151377.59        443898.53  California  191792.06
2  153441.51       101145.55        407934.54     Florida  191050.39
3  144372.41       118671.85        383199.62    New York  182901.99
4  142107.34        91391.77        366168.42     Florida  166187.94

In [110]:
from scipy.stats import pearsonr
correlation,pvalue = pearsonr(startupData['R&D Spend'] , startupData['Profit'])
print(correlation)

correlation1,pvalue = pearsonr(startupData['Administration'] , startupData['Profit'])
print(correlation1)

correlation2,pvalue = pearsonr(startupData['Marketing Spend'] , startupData['Profit'])
print(correlation2)

0.9729004656594832
0.20071656826872136
0.7477657217414766

In [118]:
#Here, we see R & D spend has pearsn correlation more than 0.85. So, we should drop R& D column

startupData.dropna([startupData['R&D Spend']])

Task 3.1 Write an explanation about how operations like imputation , feature selection, normalization etc. changes across the training and the testing data. For example, do you do imputation separately for training and testing set…?

Answer:

* IMPUTATON: Some machine learning platforms automatically drop the rows which include missing values in the model training phase and it decreases the model performance because of the reduced training size. On the other hand, most of the algorithms do not accept datasets with missing values and gives an error.
* FEATURE SELECTION: There  are totally four methods in Feature Selection that are mainly applied for fitting the model. As we split the data into training and test set. But we fit the feature selection only on the training part of the data. i.e, To get an accurate model, we perform feature selection only on training data set.
* NORMALIZATION : Normalization is used to find the min and max values on training data.This is done by calling the fit() function. By Applying the scale to training data, we can use the normalized data to train the model.for few algorithms, we can apply this scaling method on Testing data too.

Yes, if we perform Imputation on Testing data, it might result in over-fitting. So, normally we perfrom on Training datasets

Task 4.1 How to you speed up a python code?

* By using Built in functions
* By performing different operations stepwise and plotting out and writing it in order, so there will be no errors and confusions.
* Understanding data and applying techniques wisely

Task 5.1 Write a python function that extract zip code from an address column.

Thing to consider

· Code should be able to identify which columns contains address

· An address columns may not contain zipcode in some records

· These are US zipcode (5 digits)

· US zipcode can be of 9 digits but we want only the first 5 digits · https://smartystreets.com/articles/zip-4-code

· Code should be efficient and fast

· Make a dummy dataset by yourself to test out your logic

· Code should be well commented and easy to interpret

· Use google Colab

· Code should be robust enough to run on any dataset

· To test out the logic we will pass a random dataframe into your function

In [119]:
usadata = pd.read_csv('USA_Housing.csv')

In [122]:
usadata.head()

,Avg. Area Income,Avg. Area House Age,Avg. Area Number of Rooms,Avg. Area Number of Bedrooms,Area Population,Price,Address
0,79545.458574,5.682861,7.009188,4.09,23086.800503,1.059034e+06,"208 Michael Ferry Apt. 674\nLaurabury, NE 3701..."
1,79248.642455,6.002900,6.730821,3.09,40173.072174,1.505891e+06,"188 Johnson Views Suite 079\nLake Kathleen, CA..."
2,61287.067179,5.865890,8.512727,5.13,36882.159400,1.058988e+06,"9127 Elizabeth Stravenue\nDanieltown, WI 06482..."
3,63345.240046,7.188236,5.586729,3.26,34310.242831,1.260617e+06,USS Barnett\nFPO AP 44820
4,59982.197226,5.040555,7.839388,4.23,26354.109472,6.309435e+05,USNS Raymond\nFPO AE 09386

In [123]:
usadata["Address"]

0       208 Michael Ferry Apt. 674\nLaurabury, NE 3701...
1       188 Johnson Views Suite 079\nLake Kathleen, CA...
2       9127 Elizabeth Stravenue\nDanieltown, WI 06482...
3                               USS Barnett\nFPO AP 44820
4                              USNS Raymond\nFPO AE 09386
                              ...
4995                     USNS Williams\nFPO AP 30153-7653
4996                PSC 9258, Box 8489\nAPO AA 42991-3352
4997    4215 Tracy Garden Suite 076\nJoshualand, VA 01...
4998                            USS Wallace\nFPO AE 73316
4999    37778 George Ridges Apt. 509\nEast Holly, NV 2...
Name: Address, Length: 5000, dtype: object

Task 6.1 Write a python function to address typos in a column

Thing to consider

· Code should identify which columns have categorical data and do operations on that columns

· Make a dummy dataset by yourself to test out your logic

· Code should be well commented and easy to interpret

· Use google Colab

· Code should be robust enough to run on any dataset

· To test out the logic we will pass a random dataframe into your function